/*
  Doing Arithmetic
      Floating-Poing Arithmetic
*/

pub fn fn_02_03_01() {
    println!("-------------------------------------------------- 01");
    {
        println!("{}", 80.3 + 34.8); // 115.1

        // 之所以会出现下面的结果，
        // 原因在于：计算机所能够表示的浮点数是有限的，是离散的，
        // 即某些浮点数没有办法被精确地存储在计算机中，
        // 因此计算机中存储的其实是一个近似值，而不是精确的值
        println!("{}", 80.3 + 34.9); // 115.19999999999999
    }

    println!("-------------------------------------------------- 02");
    {
        println!("{}", (23. - 6.) % 5. + 20. * 30. / 7.); // 87.71428571428571
    }
}
